app/controllers/attributes_controller.rb

SELECT `eav_attribute`.* FROM `eav_attribute`
SELECT `eav_entity_type`.* FROM `eav_entity_type`
---
  def index
    @attributes                               =   EavAttribute.all
    @entity_types                             =   EntityType.all

SELECT `eav_entity_type`.* FROM `eav_entity_type`
---
  def new
    @attribute                                =   EavAttribute.new
    @entity_types                             =   EntityType.all

INSERT INTO `eav_attribute` (`attribute_code`, `backend_type`, `default_value`, `entity_type_id`, `frontend_input`, `frontend_label`, `is_required`, `is_unique`) VALUES ('xxx', 'tinyint', '', 1, 'text', 'xxx', 1, 1)
---
  def create
    begin
      @attribute                              =   EavAttribute.create_eav_attribute( params )

SELECT `eav_attribute`.* FROM `eav_attribute` WHERE `eav_attribute`.`attribute_id` = 1 LIMIT 1
SELECT `eav_entity_type`.* FROM `eav_entity_type`
---
  def edit
    @attribute                                =   EavAttribute.find(params[:id])
    @entity_types                             =   EntityType.all

UPDATE `eav_attribute` SET `default_value` = '' WHERE `eav_attribute`.`attribute_id` = 1
---
  def update
    begin
        @attribute                            =   EavAttribute.update_eav_attribute( params )

SELECT `eav_attribute`.* FROM `eav_attribute` WHERE `eav_attribute`.`attribute_id` = 1 LIMIT 1
---
  def show
     @attribute = EavAttribute.find( params[:id] )