app/controllers/attribute_sets_controller.rb

  def new
    @entity_type                = EntityType.find( ApplicationController::PRODUCT_TYPE_ID )
    @attribute_sets             = AttributeSet.find_all_by_entity_type_id( ApplicationController::PRODUCT_TYPE_ID )
---
SELECT `eav_entity_type`.* FROM `eav_entity_type` WHERE `eav_entity_type`.`entity_type_id` = 1 LIMIT 1
SELECT `eav_attribute_set`.* FROM `eav_attribute_set` WHERE `eav_attribute_set`.`entity_type_id` = 1

  def edit
    @attribute_set              =   AttributeSet.find(params[:id])
---
SELECT `eav_attribute_set`.* FROM `eav_attribute_set` WHERE `eav_attribute_set`.`attribute_set_id` = 4 LIMIT 1